Revit 2024 API
ExternallyTaggedGeometryValidation.LacksSubnodes Method
 Makes sure that the input geometry object does not have sub-nodes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static bool LacksSubnodes(
	GeometryObject geometry
)
Visual Basic
Public Shared Function LacksSubnodes ( _
	geometry As GeometryObject _
) As Boolean
Visual C++
public:
static bool LacksSubnodes(
	GeometryObject^ geometry
)
Parameters
geometry
Type: Autodesk.Revit.DB.GeometryObject
 Geometry object to be validated.
Return Value
 True if the supplied geometry object does not have sub-nodes.
See Also
ExternallyTaggedGeometryValidation Class
Autodesk.Revit.DB Namespace